In [1]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/de_project

In [3]:
%%sql
show tables;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
5 rows affected.

[('CustomerData',),
 ('CustomerDetails',),
 ('CustomerTransactions',),
 ('emp_123',),
 ('high_paid_employees',)]

In [5]:
%%sql

CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    city VARCHAR(50)
);

CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_amount DECIMAL(10, 2),
    order_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql

INSERT INTO customers (customer_id, customer_name, city) VALUES
(1, 'Alice Smith', 'New York'),
(2, 'Bob Johnson', 'Los Angeles'),
(3, 'Charlie Davis', 'Chicago'),
(4, 'Diana Moore', 'Houston'),
(5, 'Ethan Clark', 'Phoenix'),
(6, 'Fiona Lewis', 'Philadelphia');

INSERT INTO orders (order_id, customer_id, order_amount, order_date) VALUES
(101, 1, 250.00, '2025-06-01'),
(102, 2, 180.50, '2025-06-03'),
(103, 1, 75.00, '2025-06-05'),
(104, 4, 300.00, '2025-06-10'),
(105, 5, 120.75, '2025-06-15'),
(106, 3, 200.25, '2025-06-20');

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.
6 rows affected.

[]

In [8]:
%%sql
select
customer_name,
(select max(order_amount) from orders as max_order_amount)

from customers;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[('Alice Smith', Decimal('300.00')),
 ('Bob Johnson', Decimal('300.00')),
 ('Charlie Davis', Decimal('300.00')),
 ('Diana Moore', Decimal('300.00')),
 ('Ethan Clark', Decimal('300.00')),
 ('Fiona Lewis', Decimal('300.00'))]

In [12]:
%%sql

select customer_name
from customers
where customer_id in (
    select distinct customer_id
    from orders
    where order_amount >= 125
);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
4 rows affected.

[('Alice Smith',), ('Bob Johnson',), ('Charlie Davis',), ('Diana Moore',)]

In [20]:
%%sql

select customer_name
from customers
where exists(
    select * from customers where city='Houston'
);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[('Alice Smith',),
 ('Bob Johnson',),
 ('Charlie Davis',),
 ('Diana Moore',),
 ('Ethan Clark',),
 ('Fiona Lewis',)]

In [22]:
%%sql
select 
    customer_name,
    city,
    (select sum(order_amount)
    from orders o
    where o.customer_id = c.customer_id) as total_orders
from customers c;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[('Alice Smith', 'New York', Decimal('325.00')),
 ('Bob Johnson', 'Los Angeles', Decimal('180.50')),
 ('Charlie Davis', 'Chicago', Decimal('200.25')),
 ('Diana Moore', 'Houston', Decimal('300.00')),
 ('Ethan Clark', 'Phoenix', Decimal('120.75')),
 ('Fiona Lewis', 'Philadelphia', None)]

In [29]:
%%sql
drop table employees;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]

In [30]:
%%sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    job_title VARCHAR(100),
    salary DECIMAL(10, 2)
);

INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary) VALUES
(1, 'Alice', 'Johnson', 'alice.johnson@example.com', '2021-03-15', 'Software Engineer', 75000.00),
(2, 'Bob', 'Smith', 'bob.smith@example.com', '2020-07-10', 'Data Analyst', 62000.00),
(3, 'Charlie', 'Brown', 'charlie.brown@example.com', '2019-11-20', 'DevOps Engineer', 82000.00),
(4, 'Diana', 'White', 'diana.white@example.com', '2022-01-05', 'UI/UX Designer', 69000.00),
(5, 'Ethan', 'Black', 'ethan.black@example.com', '2018-05-30', 'Project Manager', 91000.00);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
5 rows affected.

[]

In [31]:
%%sql
create view high_earners as
select employee_id, first_name, last_name, salary
from employees
where salary > 90000;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'high_earners' already exists
[SQL: create view high_earners as
select employee_id, first_name, last_name, salary
from employees
where salary > 90000;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [28]:
%%sql
select * from high_earners;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
1 rows affected.

[(5, 'Ethan', 'Black', Decimal('91000.00'))]

In [ ]:
%%sql
insert into employees (employee_id, first_name, last_name, email, hire_date, job_title,salary)
 values (7,'john','sb','mark.taylor@example.com','2022-11-15','Data Engineer',12000.00)

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
1 rows affected.

[]